Revit 2024 API
MultipleValuesIndicationSettings Class
 MultipleValuesIndicationSettings is an element which contains project-wide settings for multiple values indication in Properties Palette and schedules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public class MultipleValuesIndicationSettings : Element
Visual Basic
Public Class MultipleValuesIndicationSettings _
	Inherits Element
Visual C++
public ref class MultipleValuesIndicationSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MultipleValuesIndicationSettings
See Also
MultipleValuesIndicationSettings Members
Autodesk.Revit.DB Namespace